//----------------------------------------------------------
//是否以亂數出題 : true 為使用亂數, false 為照題庫順序 
//----------------------------------------------------------
order_random = false;

//-----------------------------------------------------------
//卡片上文字格式的設定
//-----------------------------------------------------------
textFontSize = 60;		//文字大小
textAlign = 'left';		//文字的對齊方式: left , center, right


//----------------------------------------------------------
//題庫設定: flashcards 正面、反面的內容
//想強制換行的話, 就加上 \n
//----------------------------------------------------------
question_and_answers = new Array(
 '一、換位法(產生)'
	, '請按下一頁'

 , '(1) 換位：4 \n原始題目：\n　MERRYMAS'
	,'加密後：MYSEXRMRA'

 , '(2) 換位：3 \n原始題目：\n　CANPLUGGED'
	,'加密後：CPGDALGNUE'

 , '一、換位法(還原)'
	, '請按下一頁'

 , '(1) 換位：3 \n加密後：\n　CPEOURMT'
	, '原始題目：COMPUTER'

 , '(2) 換位：4 \n加密後：\n　KOEAYRBD'
	, '原始題目：KEYBOARD'

 , '二、密鑰法(產生)'
	, '請按下一頁'

 , '(1) 密鑰：251 \n原始題目：\n　MERRYXMAS'
	, '加密後：EMAMRXRSY'

 , '二、密鑰法(還原)'
	, '請按下一頁'
	
 , '(1) 密鑰：312 \n加密後：\n　GORHMATLI'
	, '原始題目：ALGORITHM'

);



